benchmark/results/throughput_mc-vs-rust/RAW/flare-plaintext-throughput_mc-run3.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.041ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.014ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.055ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.039ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.033ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.040ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.098ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.038ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01ms  464.58us   3.18ms   64.05%
    Req/Sec     6.36k   441.97     8.67k    75.46%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.99ms
 75.000%    1.35ms
 90.000%    1.63ms
 99.000%    2.07ms
 99.900%    2.41ms
 99.990%    2.67ms
 99.999%    2.93ms
100.000%    3.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.038     0.000000            1         1.00
       0.395     0.100000        95789         1.11
       0.563     0.200000       191719         1.25
       0.711     0.300000       287622         1.43
       0.852     0.400000       383214         1.67
       0.990     0.500000       478912         2.00
       1.059     0.550000       526478         2.22
       1.128     0.600000       574148         2.50
       1.199     0.650000       622235         2.86
       1.270     0.700000       669798         3.33
       1.345     0.750000       718017         4.00
       1.384     0.775000       741599         4.44
       1.426     0.800000       765789         5.00
       1.470     0.825000       789814         5.71
       1.517     0.850000       813504         6.67
       1.569     0.875000       837325         8.00
       1.598     0.887500       849288         8.89
       1.629     0.900000       861447        10.00
       1.662     0.912500       873323        11.43
       1.699     0.925000       885235        13.33
       1.741     0.937500       897204        16.00
       1.764     0.943750       903129        17.78
       1.789     0.950000       909173        20.00
       1.816     0.956250       915009        22.86
       1.847     0.962500       921111        26.67
       1.882     0.968750       926992        32.00
       1.902     0.971875       930049        35.56
       1.923     0.975000       933058        40.00
       1.946     0.978125       936039        45.71
       1.971     0.981250       938922        53.33
       2.002     0.984375       941958        64.00
       2.019     0.985938       943425        71.11
       2.037     0.987500       944913        80.00
       2.057     0.989062       946393        91.43
       2.083     0.990625       947951       106.67
       2.111     0.992188       949407       128.00
       2.127     0.992969       950190       142.22
       2.145     0.993750       950931       160.00
       2.165     0.994531       951662       182.86
       2.187     0.995313       952383       213.33
       2.215     0.996094       953149       256.00
       2.231     0.996484       953499       284.44
       2.249     0.996875       953876       320.00
       2.269     0.997266       954273       365.71
       2.289     0.997656       954611       426.67
       2.319     0.998047       954987       512.00
       2.335     0.998242       955181       568.89
       2.351     0.998437       955363       640.00
       2.369     0.998633       955544       731.43
       2.391     0.998828       955738       853.33
       2.413     0.999023       955920      1024.00
       2.427     0.999121       956018      1137.78
       2.441     0.999219       956111      1280.00
       2.459     0.999316       956207      1462.86
       2.477     0.999414       956301      1706.67
       2.501     0.999512       956386      2048.00
       2.515     0.999561       956431      2275.56
       2.529     0.999609       956477      2560.00
       2.545     0.999658       956530      2925.71
       2.559     0.999707       956570      3413.33
       2.581     0.999756       956621      4096.00
       2.591     0.999780       956640      4551.11
       2.605     0.999805       956666      5120.00
       2.621     0.999829       956688      5851.43
       2.633     0.999854       956711      6826.67
       2.655     0.999878       956736      8192.00
       2.665     0.999890       956745      9102.22
       2.681     0.999902       956757     10240.00
       2.693     0.999915       956769     11702.86
       2.709     0.999927       956781     13653.33
       2.735     0.999939       956792     16384.00
       2.743     0.999945       956799     18204.44
       2.763     0.999951       956804     20480.00
       2.779     0.999957       956810     23405.71
       2.795     0.999963       956816     27306.67
       2.819     0.999969       956821     32768.00
       2.831     0.999973       956824     36408.89
       2.843     0.999976       956828     40960.00
       2.851     0.999979       956830     46811.43
       2.875     0.999982       956833     54613.33
       2.891     0.999985       956837     65536.00
       2.891     0.999986       956837     72817.78
       2.921     0.999988       956839     81920.00
       2.927     0.999989       956840     93622.86
       2.941     0.999991       956842    109226.67
       2.949     0.999992       956843    131072.00
       2.953     0.999993       956844    145635.56
       2.981     0.999994       956845    163840.00
       2.981     0.999995       956845    187245.71
       2.995     0.999995       956846    218453.33
       3.019     0.999996       956847    262144.00
       3.019     0.999997       956847    291271.11
       3.041     0.999997       956848    327680.00
       3.041     0.999997       956848    374491.43
       3.041     0.999998       956848    436906.67
       3.167     0.999998       956849    524288.00
       3.167     0.999998       956849    582542.22
       3.167     0.999998       956849    655360.00
       3.167     0.999999       956849    748982.86
       3.167     0.999999       956849    873813.33
       3.177     0.999999       956850   1048576.00
       3.177     1.000000       956850          inf
#[Mean    =        1.006, StdDeviation   =        0.465]
#[Max     =        3.176, Total count    =       956850]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1437635 requests in 30.00s, 160.41MB read
Requests/sec:  47921.26
Transfer/sec:      5.35MB