benchmark/results/throughput_mc-vs-rust/RAW/flare-plaintext-throughput_mc-run4.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.130ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.338ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.334ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.318ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.343ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.361ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.302ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.101ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms  591.60us   4.00ms   65.43%
    Req/Sec     6.64k   527.33     9.50k    77.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.68ms
 90.000%    2.07ms
 99.000%    2.70ms
 99.900%    3.16ms
 99.990%    3.54ms
 99.999%    3.90ms
100.000%    4.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.042     0.000000            1         1.00
       0.510     0.100000       100238         1.11
       0.718     0.200000       200628         1.25
       0.890     0.300000       300836         1.43
       1.052     0.400000       400737         1.67
       1.214     0.500000       501093         2.00
       1.298     0.550000       551106         2.22
       1.385     0.600000       601110         2.50
       1.476     0.650000       651041         2.86
       1.574     0.700000       701497         3.33
       1.676     0.750000       751148         4.00
       1.730     0.775000       776321         4.44
       1.787     0.800000       801245         5.00
       1.848     0.825000       826378         5.71
       1.913     0.850000       851378         6.67
       1.984     0.875000       876555         8.00
       2.022     0.887500       888831         8.89
       2.065     0.900000       901731        10.00
       2.111     0.912500       914145        11.43
       2.163     0.925000       926761        13.33
       2.221     0.937500       939058        16.00
       2.253     0.943750       945259        17.78
       2.289     0.950000       951607        20.00
       2.327     0.956250       957681        22.86
       2.371     0.962500       963946        26.67
       2.423     0.968750       970225        32.00
       2.451     0.971875       973306        35.56
       2.483     0.975000       976501        40.00
       2.517     0.978125       979604        45.71
       2.557     0.981250       982778        53.33
       2.601     0.984375       985906        64.00
       2.625     0.985938       987414        71.11
       2.653     0.987500       988996        80.00
       2.683     0.989062       990545        91.43
       2.717     0.990625       992102       106.67
       2.759     0.992188       993686       128.00
       2.781     0.992969       994430       142.22
       2.807     0.993750       995197       160.00
       2.837     0.994531       995981       182.86
       2.867     0.995313       996769       213.33
       2.905     0.996094       997569       256.00
       2.925     0.996484       997968       284.44
       2.947     0.996875       998352       320.00
       2.971     0.997266       998717       365.71
       2.999     0.997656       999109       426.67
       3.039     0.998047       999510       512.00
       3.057     0.998242       999693       568.89
       3.081     0.998437       999892       640.00
       3.105     0.998633      1000083       731.43
       3.131     0.998828      1000292       853.33
       3.163     0.999023      1000486      1024.00
       3.179     0.999121      1000576      1137.78
       3.197     0.999219      1000673      1280.00
       3.219     0.999316      1000770      1462.86
       3.245     0.999414      1000873      1706.67
       3.273     0.999512      1000965      2048.00
       3.289     0.999561      1001014      2275.56
       3.311     0.999609      1001062      2560.00
       3.333     0.999658      1001110      2925.71
       3.365     0.999707      1001160      3413.33
       3.397     0.999756      1001209      4096.00
       3.415     0.999780      1001232      4551.11
       3.437     0.999805      1001260      5120.00
       3.461     0.999829      1001287      5851.43
       3.477     0.999854      1001307      6826.67
       3.511     0.999878      1001330      8192.00
       3.525     0.999890      1001342      9102.22
       3.547     0.999902      1001355     10240.00
       3.569     0.999915      1001367     11702.86
       3.591     0.999927      1001379     13653.33
       3.609     0.999939      1001391     16384.00
       3.617     0.999945      1001397     18204.44
       3.639     0.999951      1001404     20480.00
       3.651     0.999957      1001410     23405.71
       3.673     0.999963      1001417     27306.67
       3.699     0.999969      1001422     32768.00
       3.717     0.999973      1001425     36408.89
       3.747     0.999976      1001428     40960.00
       3.755     0.999979      1001431     46811.43
       3.799     0.999982      1001434     54613.33
       3.829     0.999985      1001437     65536.00
       3.833     0.999986      1001439     72817.78
       3.835     0.999988      1001440     81920.00
       3.905     0.999989      1001442     93622.86
       3.917     0.999991      1001443    109226.67
       3.929     0.999992      1001445    131072.00
       3.931     0.999993      1001446    145635.56
       3.931     0.999994      1001446    163840.00
       3.941     0.999995      1001447    187245.71
       3.955     0.999995      1001448    218453.33
       3.965     0.999996      1001449    262144.00
       3.965     0.999997      1001449    291271.11
       3.965     0.999997      1001449    327680.00
       3.979     0.999997      1001450    374491.43
       3.979     0.999998      1001450    436906.67
       3.991     0.999998      1001451    524288.00
       3.991     0.999998      1001451    582542.22
       3.991     0.999998      1001451    655360.00
       3.991     0.999999      1001451    748982.86
       3.991     0.999999      1001451    873813.33
       3.999     0.999999      1001452   1048576.00
       3.999     1.000000      1001452          inf
#[Mean    =        1.260, StdDeviation   =        0.592]
#[Max     =        3.998, Total count    =      1001452]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504620 requests in 30.00s, 167.89MB read
Requests/sec:  50153.24
Transfer/sec:      5.60MB